Revit 2027 API
BuiltInFailures.WallFailures.CannotSplitJoinHostsInplaceFamilies Property
 Can't split/join this host because there are instances of In-place Families that cut openings into it. Edit or delete instances first so they don't cut into the host to be split or joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSplitJoinHostsInplaceFamilies { get; }
Public Shared ReadOnly Property CannotSplitJoinHostsInplaceFamilies As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSplitJoinHostsInplaceFamilies {
	FailureDefinitionId^ get ();
}
static member CannotSplitJoinHostsInplaceFamilies : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace